---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipeSettings.SizeSuffix
source: html/49eb536d-ce5e-5484-8311-7d8c13947b2d.htm
---
# Autodesk.Revit.DB.Plumbing.PipeSettings.SizeSuffix Property

The size suffix string.

## Syntax (C#)
```csharp
public string SizeSuffix { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null